TDPortal/Utilities/EnhancedExposedServicesTestTool/ExposedServicesTestToolClient/Requests/FindNearest/V1/FindNearestService_FindFuelGenieSites.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <FindFuelGenieSites xmlns="http://www.transportdirect.info/TransportDirect.EnhancedExposedServices.FindNearest.V1">
      <transactionId>TransactionIdFindFuelGenieSites</transactionId>
      <language>en-GB</language>
      <postcode></postcode>
      <easting>531261</easting>
      <northing>182230</northing>
      <searchType>F</searchType>
      <searchFlag>I</searchFlag>
      <searchRadius>3</searchRadius>
    </FindFuelGenieSites>
  </soap:Body>
</soap:Envelope>