TDPortal/Utilities/EnhancedExposedServicesTestTool/ExposedServicesTestToolClient/Requests/FindNearest/V1/FindNearestService_GetGridReference.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <GetGridReference xmlns="http://www.transportdirect.info/TransportDirect.EnhancedExposedServices.FindNearest.V1">
      <transactionId>TransactionIdGetGridReference</transactionId>
      <language>en-GB</language>
      <postcode>EC1R 3HN</postcode>
    </GetGridReference>
  </soap:Body>
</soap:Envelope>