TDPortal/Utilities/EnhancedExposedServicesTestTool/ExposedServicesTestToolClient/Requests/FindNearest/V1/FindNearestService_FindNearestBusStops .xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <FindNearestBusStops xmlns="http://www.transportdirect.info/TransportDirect.EnhancedExposedServices.FindNearest.V1">
      <transactionId>TransactionIdFindNearestBusStops</transactionId>
      <language>en-GB</language>
      <gridReference>
        <Easting>531261</Easting>
        <Northing>182231</Northing>
      </gridReference>
      <maxResults>5</maxResults>
    </FindNearestBusStops>
  </soap:Body>
</soap:Envelope>